starjunes/GD32/source/hal/driver/c/st_uart_drv.c
/******************************************************************************
**
** Filename:     st_uart_drv.c
** Copyright:    
** Description:  该模块主要实现串口的驱动管理
**
*******************************************************************************
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#include "yx_include.h"
#include "stm32f0xx.h"
#include "stm32f0xx_conf.h"
#include "yx_dym_drv.h"
#include "yx_loopbuf.h"
#include "st_uart_reg.h"
#include "st_uart_irq.h"
#include "st_uart_drv.h"
#include "st_irq_drv.h"

/*
********************************************************************************
* define config parameters
********************************************************************************
*/
#define _SENDING             0x01
#define _OPEN                0x80

#define DMA_TX_LEN           32
#define DMA_RX_LEN           32

/*
********************************************************************************
* define struct
********************************************************************************
*/

typedef struct {
    INT8U       status;
    INT8U       sel;
    INT8U       p_dma_tx[DMA_TX_LEN];
    INT8U       p_dma_rx0[DMA_RX_LEN];
    INT8U       p_dma_rx1[DMA_RX_LEN];
    INT8U      *p_rx;
    INT8U      *p_tx;

	INT32U      tx_len;
	INT32U      rx_len;
    
    LOOP_BUF_T  r_round;
    LOOP_BUF_T  s_round;
} UART_T;

/*
********************************************************************************
* define module variants
********************************************************************************
*/
static INT8U s_uart1map;
static UART_T s_uart[UART_COM_MAX];





/*******************************************************************
** 函数名称: STM32_UART_PinsConfig
** 函数描述: 管脚配置
** 参数:     [in] pinfo: 配置表
**           [in] onoff: 打开/关闭串口, TRUE-打开串口,FALSE-关闭串口
** 返回:     无
********************************************************************/
static void STM32_UART_PinsConfig(const UART_TBL_T *pinfo, INT8U onoff)
{
    GPIO_InitTypeDef gpio_initstruct;
    
    if (pinfo == 0) {
        return;
    }
    
    /* remap uart pins if need */
    if (pinfo->uart_remap != 0) {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
        //GPIO_PinRemapConfig(pinfo->uart_remap, ENABLE);
    }
    
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);                        /* 开启GPIO系统时钟 */
    
    /* Configure USARTx_Tx as alternate function push-pull */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->uart_pin_tx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_AF;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        if (pinfo->gpio_base == GPIOB_BASE) {
            GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->uart_pin_tx, GPIO_AF_0);
        } else {
            GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->uart_pin_tx, GPIO_AF_1);
        }
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_OUT;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->uart_pin_tx));
    }
    
    /* Configure USARTx_Rx as input floating */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->uart_pin_rx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_AF;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        if (pinfo->gpio_base == GPIOB_BASE) {
            GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->uart_pin_rx, GPIO_AF_0);
        } else {
            GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->uart_pin_rx, GPIO_AF_1);
        }
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_OUT;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->uart_pin_rx));
    }
}

/*******************************************************************
** 函数名称: STM32_UART_DMAConfig
** 函数描述: 配置UART发送为DMA方式
** 参数:     [in] pinfo  : 配置参数
** 返回:     无
********************************************************************/
static void STM32_UART_DMAConfig(const UART_TBL_T *pinfo)
{
    INT32S irq_id;
    BOOLEAN is_dma1;
    IRQ_SERVICE_FUNC irqhandler;
    DMA_InitTypeDef dma_initstruct;
    
    if (pinfo == 0) {
        return;
    }
    
    /* 配置发送通道 */
	if (pinfo->dma_base_tx != 0) {
        switch (pinfo->dma_base_tx)
	    {
        case DMA1_Channel2_BASE:                          /* for uart1 tx */
            irq_id   = DMA1_Channel2_3_IRQn;
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL2_IrqHandle;
            is_dma1  = TRUE;
            break;
        case DMA1_Channel4_BASE:                          /* for uart2 tx */
        case DMA1_Channel7_BASE:                          /* for uart3 tx */
            #ifdef STM32F072
            irq_id   = DMA1_Channel4_5_6_7_IRQn;
            #else
            irq_id   = DMA1_Channel4_5_IRQn;
            #endif
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL4_IrqHandle;
            is_dma1  = TRUE;
	  	    break;
        default:
            return;
        }
    
        /* dma clock enable */
        if (is_dma1) {
            RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
        } else {
            //RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
        }
    
        DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_tx);        /* 恢复DMA通道 */
    
        DMA_StructInit(&dma_initstruct);
        dma_initstruct.DMA_PeripheralBaseAddr  = (INT32U)&(((USART_TypeDef *)pinfo->uart_base)->TDR);/* 外设基准地址 */
        dma_initstruct.DMA_MemoryBaseAddr      = 0;                            /* 内存基准地址 */
        dma_initstruct.DMA_DIR                 = DMA_DIR_PeripheralDST;        /* 通道方向 */
        dma_initstruct.DMA_BufferSize          = 0;                            /* 内存缓存大小 */
        dma_initstruct.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;    /* 外设地址不自增 */
        dma_initstruct.DMA_MemoryInc           = DMA_MemoryInc_Enable;         /* 内存地址自增 */
        dma_initstruct.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;  /* 字节模式 */
        dma_initstruct.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;      /* 字节模式 */
        dma_initstruct.DMA_Mode                = DMA_Mode_Normal;              /* 正常模式 */
        dma_initstruct.DMA_Priority            = DMA_Priority_Low;                 
        dma_initstruct.DMA_M2M                 = DMA_M2M_Disable;
    
