starjunes/GD32/source/hal/driver/c/st_uart_drv.c
        DMA_Init((DMA_Channel_TypeDef *)pinfo->dma_base_tx, &dma_initstruct);
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                  /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                           /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_TXDMA);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                   /* 打开中断 */
    }
    
    /* 配置接收通道 */
    if (pinfo->dma_base_rx != 0) {
        switch (pinfo->dma_base_rx)
	    {
        case DMA1_Channel3_BASE:                          /* for uart1 rx */
            irq_id   = DMA1_Channel2_3_IRQn;
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL2_IrqHandle;
            is_dma1  = TRUE;
            break;
        case DMA1_Channel5_BASE:                          /* for uart2 rx */
        case DMA1_Channel6_BASE:                          /* for uart3 rx */
            #ifdef STM32F072
            irq_id   = DMA1_Channel4_5_6_7_IRQn;
            #else
            irq_id   = DMA1_Channel4_5_IRQn;
            #endif
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL4_IrqHandle;
            is_dma1  = TRUE;
	  	    break;
        default:
            return;
        }
    
        /* dma clock enable */
        if (is_dma1) {
            RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
        } else {
            //RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
        }
    
        DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);             /* 恢复DMA通道 */
    
        DMA_StructInit(&dma_initstruct);
        dma_initstruct.DMA_PeripheralBaseAddr  = (INT32U)&(((USART_TypeDef *)pinfo->uart_base)->RDR);/* 外设基准地址 */
        dma_initstruct.DMA_MemoryBaseAddr      = (INT32U)s_uart[pinfo->com].p_dma_rx0;     /* 内存基准地址 */
        dma_initstruct.DMA_DIR                 = DMA_DIR_PeripheralSRC;        /* 通道方向 */
        dma_initstruct.DMA_BufferSize          = DMA_RX_LEN;                   /* 内存缓存大小 */
        dma_initstruct.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;    /* 外设地址不自增 */
        dma_initstruct.DMA_MemoryInc           = DMA_MemoryInc_Enable;         /* 内存地址自增 */
        dma_initstruct.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;  /* 字节模式 */
        dma_initstruct.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;      /* 字节模式 */
        dma_initstruct.DMA_Mode                = DMA_Mode_Normal;              /* 正常模式 */
        dma_initstruct.DMA_Priority            = DMA_Priority_Low;                 
        dma_initstruct.DMA_M2M                 = DMA_M2M_Disable;
        s_uart[pinfo->com].sel = 0;
    
        DMA_Init((DMA_Channel_TypeDef *)pinfo->dma_base_rx, &dma_initstruct);
    
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                  /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                           /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_RXDMA);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                   /* 打开中断 */
    }
}

/*******************************************************************
** 函数名称: STM32_UART_TxDMAStart
** 函数描述: 启动串口DMA发送功能
** 参数:     [in] uart_id: 串口通道编号
**           [in] memaddr: DMA内存地址
**           [in] memlen:  发送数据长度
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) static void STM32_UART_TxDMAStart(INT8U com, INT8U *memaddr, INT16U memlen)
{
    const UART_TBL_T *pinfo;
    DMA_Channel_TypeDef  *dma_channel;
    
    pinfo = ST_UART_GetRegTblInfo(com);
    dma_channel = (DMA_Channel_TypeDef *)pinfo->dma_base_tx;
    
    DMA_Cmd(dma_channel, DISABLE);                                             /* disable DMA channelx transfer */
    DMA_ITConfig(dma_channel, DMA_IT_TC, DISABLE);                             /* disable DMA channelx transfer complete interrupt */
    
    dma_channel->CMAR  = (INT32U)memaddr;
    dma_channel->CNDTR = memlen;
    
    DMA_ITConfig(dma_channel, DMA_IT_TC, ENABLE);                              /* enable DMA channelx transfer complete interrupt */
    DMA_Cmd(dma_channel, ENABLE);                                              /* enable DMA channelx transfer */
}

/*******************************************************************
** 函数名称: STM32_UART_IrqConfig
** 函数描述: 配置串口中断功能
** 参数:     [in] pinfo  : 配置参数
**           [in] inter  : 中断配置
** 返回:     无
********************************************************************/
static void STM32_UART_IrqConfig(const UART_TBL_T *pinfo)
{
    INT32S irq_id;
    IRQ_SERVICE_FUNC irqhandler;
    
    if (pinfo == 0) {
        return;
    }
    
    switch (pinfo->uart_base)
    {
    case USART1_BASE:
        irq_id = USART1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART1_IrqHandle;
	  	break;
    case USART2_BASE:
        irq_id = USART2_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART2_IrqHandle;
        break;
#ifdef STM32F072
    case USART3_BASE:
        irq_id = USART3_4_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART3_IrqHandle;
        break;
#endif
    default:
        return;
    }
    
    ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
    ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
    ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_UART);
    ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */
    
    //USART_ITConfig((USART_TypeDef *)pinfo->uart_base, inter, ENABLE); /* enable the usart rx or tx interrupt */
}

/*******************************************************************
** 函数名称: STM32_UART_Init
** 函数描述: 串口通信参数配置，并设置是否支持DMA
** 参数:     [in]  cfg:串口配置参数 
** 返回:     无
********************************************************************/
BOOLEAN printf_com(const char *fmt, ...);
static void STM32_UART_Init(UART_CFG_T *cfg)
{
    INT8U com;
    INT16U stopbit, databit, parity, mode;
    INT32U baud;
    USART_InitTypeDef usart_initstruct;
    const UART_TBL_T *pinfo;
	  
    com = cfg->com;
    pinfo = ST_UART_GetRegTblInfo(com);
	 	    
