starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    /* usart clock enable */
    if (pinfo->uart_base == USART1_BASE) {
        RCC_APB2PeriphClockCmd(pinfo->uart_rcc, ENABLE);
    } else {
        RCC_APB1PeriphClockCmd(pinfo->uart_rcc, ENABLE);
    }
    
    baud = cfg->baud;
    switch (cfg->databit)
    {
	case UART_DATABIT_8:
	    databit = USART_WordLength_8b;
	    break;
	case UART_DATABIT_9:
	    databit = USART_WordLength_9b;
	    break;
	default:
	    databit = USART_WordLength_8b;
	    break;
	}
	     
    switch (cfg->stopbit)
    {
    case UART_STOPBIT_1:
        stopbit = USART_StopBits_1;
	    break;
	case UART_STOPBIT_1_5:
	    stopbit = USART_StopBits_1_5;
	    break;
	case UART_STOPBIT_2:
	    stopbit = USART_StopBits_2;
	    break;
	case UART_STOPBIT_0_5:
	    //stopbit = USART_StopBits_0_5;
        stopbit = USART_StopBits_1;
	    break;
	default:
	    stopbit = USART_StopBits_1;
	    break;
	}
	
	switch (cfg->parity)
	{
	case UART_PARITY_NONE:
	    parity = USART_Parity_No;
	    break;
	case UART_PARITY_EVEN:
	    parity = USART_Parity_Even;
	    break;
	case UART_PARITY_ODD:
	    parity = USART_Parity_Odd;
	    break;
	default:
	    parity = USART_Parity_No;
	    break;
	}
	mode = USART_Mode_Rx | USART_Mode_Tx;
	
	/* deinit usart */
	USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
	USART_DeInit((USART_TypeDef *)pinfo->uart_base);
	
	usart_initstruct.USART_BaudRate            = baud;
	usart_initstruct.USART_WordLength          = databit;
	usart_initstruct.USART_StopBits            = stopbit;
	usart_initstruct.USART_Parity              = parity;
	usart_initstruct.USART_Mode                = mode;
	usart_initstruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	/* configure usart */
	USART_Init((USART_TypeDef *)pinfo->uart_base, &usart_initstruct);
	
	if (pinfo->dma_base_tx != 0 && pinfo->dma_base_rx != 0) {
	    /* enable usart dma tx and rx request */
	    USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Tx | USART_DMAReq_Rx, ENABLE);
	    STM32_UART_IrqConfig(pinfo);
	    USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_IDLE, ENABLE);
    } else if (pinfo->dma_base_tx != 0) {
        /* enable usart dma tx request */
        USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Tx, ENABLE);
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_RXNE, ENABLE);
        //USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_ERR, ENABLE);
    } else if (pinfo->dma_base_rx != 0) {
        /* enable usart dma rx request */
        USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Rx, ENABLE);
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_TXE, ENABLE);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_IDLE, ENABLE);
    } else {
	    /* config usart rx or tx interrupt and enable it*/
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_RXNE, ENABLE);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_TXE, ENABLE);
	}
    
    /* enable the usart */
    USART_Cmd((USART_TypeDef *)pinfo->uart_base, ENABLE);
}

/*******************************************************************
** 函数名称: ST_UART_InitDrv
** 函数描述: 初始化串口驱动
** 参数:     无
** 返回:     无
********************************************************************/
void ST_UART_InitDrv(void)
{
    UART_CFG_T cfg;
    
    YX_MEMSET(&s_uart, 0, sizeof(s_uart));
    
    cfg.com     = UART_COM_0;
    cfg.baud    = 115200;
    cfg.parity  = UART_PARITY_NONE;
    cfg.databit = UART_DATABIT_8;
    cfg.stopbit = UART_STOPBIT_1;
    
    cfg.rx_fcm  = UART_FCM_NULL;     /* 接收流控模式,见UART_FCM_E */
    cfg.tx_fcm  = UART_FCM_NULL;     /* 发送流控模式,见UART_FCM_E */
    
    cfg.rx_len  = 256;               /* 配置平台接收缓存长度 */
    cfg.tx_len  = 512;               /* 配置平台发送缓存长度 */
    
    //ST_UART_OpenUart(&cfg);
    
    cfg.com     = UART_COM_1;
    cfg.baud    = 9600;
    cfg.rx_len  = 128;               /* 配置平台接收缓存长度 */
    cfg.tx_len  = 512;               /* 配置平台发送缓存长度 */
    ST_UART_OpenUart(&cfg);
}

/*******************************************************************
** 函数名称:   ST_UART_OpenUart
** 函数描述:   打开串口并初始化
** 参数:       [in]  cfg:串口配置参数 
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_OpenUart(UART_CFG_T *cfg)
{
    INT8U com;
    const UART_TBL_T *pinfo;
    
    OS_ASSERT((cfg != 0), RETURN_FALSE);
    OS_ASSERT((cfg->com < UART_COM_MAX), RETURN_FALSE);
    OS_ASSERT((cfg->tx_len != 0), RETURN_FALSE);
    OS_ASSERT((cfg->rx_len != 0), RETURN_FALSE);
    
    com = cfg->com;
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if (com == UART_COM_2) {
        s_uart1map = UART_COM_2 - UART_COM_0;
    }
    
    if ((s_uart[com].status & _OPEN) != 0) {                                   /* 串口已打开 */
        s_uart[com].status &= ~(_OPEN | _SENDING);
        USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
        USART_DeInit((USART_TypeDef *)pinfo->uart_base);
        
        if (pinfo->dma_base_tx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_tx);
        }
        
        if (pinfo->dma_base_rx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);
        }
    }
    
    if (s_uart[com].p_rx == 0 || s_uart[com].rx_len != cfg->rx_len) {
        if (s_uart[com].p_rx != 0) {
            YX_DYM_Free(s_uart[com].p_rx);
        }
        s_uart[com].p_rx = YX_DYM_Alloc(cfg->rx_len);
        if (s_uart[com].p_rx == 0) {
            return false;
        }
        
        s_uart[com].rx_len = cfg->rx_len;
        YX_InitLoopBuffer(&s_uart[com].r_round, s_uart[com].p_rx, s_uart[com].rx_len);
    }
    
    if (s_uart[com].p_tx == 0 || s_uart[com].tx_len != cfg->tx_len) {
        if (s_uart[com].p_tx != 0) {
            YX_DYM_Free(s_uart[com].p_tx);
        }
        s_uart[com].p_tx = YX_DYM_Alloc(cfg->tx_len);
        if (s_uart[com].p_tx == 0) {
            return false;
        }
        
        s_uart[com].tx_len = cfg->tx_len;
        YX_InitLoopBuffer(&s_uart[com].s_round, s_uart[com].p_tx, s_uart[com].tx_len);
    }
    
    STM32_UART_PinsConfig(pinfo, TRUE);                                        /* configure the rx & tx pins */
    STM32_UART_DMAConfig(pinfo);                                               /* config uart1-4 tx DMA mode */
    STM32_UART_Init(cfg);                                                      /* 通信参数配置 */
    
