starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    s_uart[com].status = _OPEN;
    return true;
}

/*******************************************************************
** 函数名:     ST_UART_CloseUart
** 函数描述:   关闭串口
** 参数:       [in] com: 通道编号,见UART_COM_E
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN ST_UART_CloseUart(INT8U com)
{
    const UART_TBL_T *pinfo;
    
    if (com >= UART_COM_MAX) {
        return false;
    }
    
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if (com == UART_COM_2) {
        s_uart1map = 0;
    }
    
    if ((s_uart[com].status & _OPEN) != 0) {                                   /* 串口已打开 */
        s_uart[com].status &= ~(_OPEN | _SENDING);
        STM32_UART_PinsConfig(pinfo, FALSE);
        USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
        USART_DeInit((USART_TypeDef *)pinfo->uart_base);
        
        if (pinfo->dma_base_tx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_tx);
        }
        
        if (pinfo->dma_base_rx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);
        }
    }
    s_uart[com].status &= ~(_OPEN | _SENDING);
    
    if (s_uart[com].p_rx != 0) {
        YX_DYM_Free(s_uart[com].p_rx);
        s_uart[com].p_rx = 0;
        s_uart[com].rx_len = 0;
    }
    
    if (s_uart[com].p_tx != 0) {
        YX_DYM_Free(s_uart[com].p_tx);
        s_uart[com].p_tx = 0;
        s_uart[com].tx_len = 0;
    }
    
    return true;
}

/*******************************************************************
** 函数名称: ST_UART_ReadChar
** 函数描述: 获取一个字节数据
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     成功返回串口数据，失败返回-1
********************************************************************/
INT32S ST_UART_ReadChar(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return -1;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return -1;
    }
    
    return YX_ReadLoopBuffer(&s_uart[com].r_round);
}

/*******************************************************************
** 函数名称: ST_UART_WriteChar
** 函数描述: 发送一个字节
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] data:字节数据
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteChar(INT8U com, INT8U data)
{
    INT8U result;
    INT16U i, bufsize;
    INT32U cpu_sr;

    if (com >= UART_COM_MAX) {
        return FALSE;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return FALSE;
    }
    
    result = YX_WriteLoopBuffer(&s_uart[com].s_round, data);
    
    OS_ENTER_CRITICAL();
    if ((s_uart[com].status & _SENDING) == 0) {
        OS_EXIT_CRITICAL();
        
        bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
        if (bufsize > 0) {
            if (bufsize > DMA_TX_LEN) {
                bufsize = DMA_TX_LEN;
            }
    
            for (i = 0; i < bufsize; i++) {
                s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer(&s_uart[com].s_round);
            }
            
            s_uart[com].status |= _SENDING;
            STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
        }
    } else {
        OS_EXIT_CRITICAL();
    }
    
    return result;
}

/*******************************************************************
** 函数名称: ST_UART_WriteCharWait
** 函数描述: 发送一个字节,等待发送完毕
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] data:字节数据
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteCharWait(INT8U com, INT8U data)
{
    const UART_TBL_T *pinfo;
    
    if (com >= UART_COM_MAX) {
        return false;
    }
    
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    //while ((((USART_TypeDef *)pinfo->uart_base)->ISR & 0x80) == 0) {};
    ((USART_TypeDef *)pinfo->uart_base)->TDR = (data & 0x01FF);
    while ((((USART_TypeDef *)pinfo->uart_base)->ISR & 0x80) == 0) {};
    
    return true;
}

/*******************************************************************
** 函数名称: ST_UART_WriteBlock
** 函数描述: 发送一串数据
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] sptr:数据指针
**           [in] slen:数据长度
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteBlock(INT8U com, INT8U *sptr, INT16U slen)
{
    INT8U result;
    INT16U i, bufsize;
    INT32U cpu_sr;
	  
    if ((sptr == 0) || (slen == 0)) {
        return FALSE;
    }
    
    if (com >= UART_COM_MAX) {
        return FALSE;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return FALSE;
    }
    
    result = YX_WriteBlockLoopBuffer(&s_uart[com].s_round, sptr, slen);
        
    OS_ENTER_CRITICAL();
    if ((s_uart[com].status & _SENDING) == 0) {
        OS_EXIT_CRITICAL();
        
        bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
        if (bufsize > 0) {
            if (bufsize > DMA_TX_LEN) {
                bufsize = DMA_TX_LEN;
            }
    
            for (i = 0; i < bufsize; i++) {
                s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer(&s_uart[com].s_round);
            }

    		s_uart[com].status |= _SENDING;
            STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
        }
    } else {
        OS_EXIT_CRITICAL();
    }
    
    return result;
}

/*******************************************************************
** 函数名称: ST_UART_GetRecvBytes
** 函数描述: 获取已接收字节数
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     已接收字节数
********************************************************************/
INT32U ST_UART_GetRecvBytes(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return 0;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return 0;
    }
    
    return YX_UsedOfLoopBuffer(&s_uart[com].r_round);
}

/*******************************************************************
** 函数名称: ST_UART_LeftOfSendbuf
** 函数描述: 获取发送缓存剩余空间
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     剩余空间字节数
********************************************************************/
INT32U ST_UART_LeftOfSendbuf(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return 0;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return 0;
    }
    
