starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    return YX_LeftOfLoopBuffer(&s_uart[com].s_round);
}

/*******************************************************************
** 函数名称: UARTx_TxDMAIrqService
** 函数描述: DMA发送中断处理
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void UARTx_TxDMAIrqService(INT8U com)
{
    INT16U i, bufsize;
	const UART_TBL_T *pinfo;
	
	if (com >= UART_COM_MAX) {
	    return;
	}
	
	com = (com == 0) ? (com + s_uart1map) : com;
	    
    pinfo = ST_UART_GetRegTblInfo(com);
    if (((s_uart[com].status & _OPEN) == 0) || ((s_uart[com].status & _SENDING) == 0)) {
        DMA_Cmd((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DISABLE);
        DMA_ITConfig((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DMA_IT_TC, DISABLE);
        return;
    }
    
    bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
    if (bufsize == 0) {
        s_uart[com].status &= (~_SENDING);
        DMA_ITConfig((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DMA_IT_TC, DISABLE);
        DMA_Cmd((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DISABLE);
        return;
    }
    
    if (bufsize > DMA_TX_LEN) {
        bufsize = DMA_TX_LEN;
    }
    
    for (i = 0; i < bufsize; i++) {
        s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer_INT(&s_uart[com].s_round);
    }
    
    STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
}

/*******************************************************************
** 函数名称: UARTx_RxDMAIrqService
** 函数描述: DMA接收中断处理
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void UARTx_RxDMAIrqService(INT8U com)
{
    INT16U bufsize;
	const UART_TBL_T *pinfo;
	DMA_Channel_TypeDef *dma_register_base;
	
	if (com >= UART_COM_MAX) {
	    return;
	}
    
    com = (com == 0) ? (com + s_uart1map) : com;
	    
    pinfo = ST_UART_GetRegTblInfo(com);
	dma_register_base = (DMA_Channel_TypeDef *)pinfo->dma_base_rx;
    if ((s_uart[com].status & _OPEN) == 0) {
        DMA_Cmd(dma_register_base, DISABLE);
        return;
    }
    
    bufsize = DMA_RX_LEN - DMA_GetCurrDataCounter(dma_register_base);
    
    DMA_Cmd(dma_register_base, DISABLE);  //停止使能 才能修改计数器
    if (s_uart[com].sel == 0) {
        dma_register_base->CMAR  = (INT32U)s_uart[pinfo->com].p_dma_rx1;
        dma_register_base->CNDTR = DMA_RX_LEN;
    } else {
        dma_register_base->CMAR  = (INT32U)s_uart[pinfo->com].p_dma_rx0;
        dma_register_base->CNDTR = DMA_RX_LEN;
    }
    DMA_Cmd(dma_register_base, ENABLE);
    
    if (s_uart[com].sel == 0) {
        s_uart[com].sel = 1;
        YX_WriteBlockLoopBuffer_INT(&s_uart[com].r_round, s_uart[pinfo->com].p_dma_rx0, bufsize);
    } else {
        s_uart[com].sel = 0;
        YX_WriteBlockLoopBuffer_INT(&s_uart[com].r_round, s_uart[pinfo->com].p_dma_rx1, bufsize);
    }
}

/*******************************************************************
** 函数名称: Uartx_TxIrqService
** 函数描述: UART发送中断处理
** 参数:     [in] com:                 通道编号,见UART_COM_E
**           [in] uart_base:  uart寄存器基址
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void Uartx_TxIrqService(INT8U com, INT32U uart_base)
{
    INT32S ch;
    
    if (com >= UART_COM_MAX) {
	    return;
	}
    
    com = (com == 0) ? (com + s_uart1map) : com;
	
	if ((s_uart[com].status & _OPEN) != 0) {
	    ch = YX_ReadLoopBuffer_INT(&s_uart[com].s_round);
	    if (ch != -1) {
	        ((USART_TypeDef *)uart_base)->TDR = (ch & 0x01FF);
	    }
	} else {
	    USART_ITConfig((USART_TypeDef *)uart_base, USART_IT_TXE, DISABLE);
	}
}

/*******************************************************************
** 函数名称: Uartx_RxIrqService
** 函数描述: UART接收中断处理
** 参数:     [in] com:                 通道编号,见UART_COM_E
**           [in] uart_base:  uart寄存器基址
**           [in] data:                字节数据
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void Uartx_RxIrqService(INT8U com, INT32U uart_base, INT16U data)
{
    if (com >= UART_COM_MAX) {
	    return;
	}
	
	com = (com == 0) ? (com + s_uart1map) : com;
	
	if ((s_uart[com].status & _OPEN) != 0) {
	    YX_WriteLoopBuffer_INT(&s_uart[com].r_round, data);
	} else {
	    USART_ITConfig((USART_TypeDef *)uart_base, USART_IT_RXNE, DISABLE);
	}
}




